export type comments = {
  id: number;
  text: string;
};
const reviews: comments[] = [
  {
    id: 1,
    text: 'طعم لذيذ ومذهل، لم أتذوق مثله من قبل!',
  },
  {
    id: 2,
    text: 'الطبق رائع بكل معنى الكلمة، لا يمكنني التوقف عن تناوله.',
  },
  {
    id: 3,
    text: 'تجربة لا تُنسى، شكرًا على هذا الطعم الرائع.',
  },
  {
    id: 4,
    text: 'غني بالنكهات والتوابل، أفضل ما يمكن تناوله!',
  },
  {
    id: 5,
    text: 'لا يقاوم، يجب أن تجربوه لتصدقوا.',
  },
  {
    id: 6,
    text: 'سحرتني هذه الوصفة، سأعيد تناولها مرارًا وتكرارًا.',
  },
  {
    id: 7,
    text: 'طعم لا يُقاوم، مزيج مثالي من النكهات.',
  },
  {
    id: 8,
    text: 'أبهرني هذا الطبق، لقد تخطى توقعاتي بكل تأكيد.',
  },
  {
    id: 9,
    text: 'لقد كسب قلبي، سأنصح الجميع بتجربته.',
  },
  {
    id: 10,
    text: 'لا يوجد كلام يصف كم أنا مبهرة بهذا الطعم، تجربة فريدة!',
  },
];
export default reviews;
