import { StaticImageData } from 'next/image';
import b1 from '@/app/assets/images/items/breakfast1.png';
import b2 from '@/app/assets/images/items/breakfast2.png';
import b3 from '@/app/assets/images/items/breakfast3.png';
import b4 from '@/app/assets/images/items/breakfast4.png';
import b5 from '@/app/assets/images/items/breakfast5.png';
import b6 from '@/app/assets/images/items/breakfast6.png';
import mint1 from '@/app/assets/images/items/mint1.png';
import mint2 from '@/app/assets/images/items/mint2.png';

export type items = {
  id: string;
  title: string;
  additional: string;
  src: StaticImageData;
  steps: Array<string>;
  service: number;
  timeForCooking: {
    time: number;
    type: string;
  };
  down: StaticImageData;
  up: StaticImageData;
  type: string;
  color: string;
};
const itemsArray: items[] = [
  {
    id: '1',
    title: 'توست بالفطر والبيض للرجيم',
    additional: '',
    src: b1,
    steps: [
      'تُغسل حبَّات الفطر، وتُقطَّع بحجم متساو.',
      'تُذوب الزبدة في مقلاة، ويُضاف فرم الفطر، مع التقليب لنحو ثلاث دقائق، وذلك على حرارة متوسِّطة.',
      'يُضاف الثوم وأوراق الكايل إلى المقلاة مع الفطر والملح والفلفل، وتُقلَّب المكوِّنات، ويُسكب الماء. تُقلَّب المكوِّنات مجدَّدًا، وتبقى على النار، حتَّى يذبل الكايل.',
      ' في قدر صغيرة حاوية الماء المغلي، تُضاف ركوة تحتوي البيضة، وتُخفَّف الحرارة، وذلك حتَّى تطهى البيضة. يُصبُّ الخل على البيضة بعدها، مع تحريك البيضة بصورة دائريَّة. ثمَّ، تُكسر البيضة من منتصفها، وتُطهى لثلاث أو أربع دقائق إضافيَّة.',
      'طريقة التقديم: يُحمَّص الخبز، ويوضع في طبق التقديم، ويوزَّع الفطر والكايل عليه، وعلى الوجه تُضاف البيضة. وينثر الفلفل الأسود.',
    ],
    service: 4,
    timeForCooking: {
      time: 30,
      type: 'دقيقة',
    },
    down: mint2,
    up: mint1,
    color: '#ad7646',
    type: 'نباتي',
  },
  {
    id: '2',
    title: 'شكشوكة البيض والخضار',
    additional: '',
    src: b2,
    steps: [
      'تُغسل حبَّات الفطر، وتُقطَّع بحجم متساو.',
      'تُذوب الزبدة في مقلاة، ويُضاف فرم الفطر، مع التقليب لنحو ثلاث دقائق، وذلك على حرارة متوسِّطة.',
      'يُضاف الثوم وأوراق الكايل إلى المقلاة مع الفطر والملح والفلفل، وتُقلَّب المكوِّنات، ويُسكب الماء. تُقلَّب المكوِّنات مجدَّدًا، وتبقى على النار، حتَّى يذبل الكايل.',
      ' في قدر صغيرة حاوية الماء المغلي، تُضاف ركوة تحتوي البيضة، وتُخفَّف الحرارة، وذلك حتَّى تطهى البيضة. يُصبُّ الخل على البيضة بعدها، مع تحريك البيضة بصورة دائريَّة. ثمَّ، تُكسر البيضة من منتصفها، وتُطهى لثلاث أو أربع دقائق إضافيَّة.',
      'طريقة التقديم: يُحمَّص الخبز، ويوضع في طبق التقديم، ويوزَّع الفطر والكايل عليه، وعلى الوجه تُضاف البيضة. وينثر الفلفل الأسود.',
    ],
    service: 4,
    timeForCooking: {
      time: 30,
      type: 'دقيقة',
    },
    down: mint2,
    up: mint1,
    color: '#8c5937',
    type: 'نباتي',
  },
  {
    id: '3',
    title: 'البيض بالطريقة التركية',
    additional: '',
    src: b3,
    steps: [
      'تُغسل حبَّات الفطر، وتُقطَّع بحجم متساو.',
      'تُذوب الزبدة في مقلاة، ويُضاف فرم الفطر، مع التقليب لنحو ثلاث دقائق، وذلك على حرارة متوسِّطة.',
      'يُضاف الثوم وأوراق الكايل إلى المقلاة مع الفطر والملح والفلفل، وتُقلَّب المكوِّنات، ويُسكب الماء. تُقلَّب المكوِّنات مجدَّدًا، وتبقى على النار، حتَّى يذبل الكايل.',
      ' في قدر صغيرة حاوية الماء المغلي، تُضاف ركوة تحتوي البيضة، وتُخفَّف الحرارة، وذلك حتَّى تطهى البيضة. يُصبُّ الخل على البيضة بعدها، مع تحريك البيضة بصورة دائريَّة. ثمَّ، تُكسر البيضة من منتصفها، وتُطهى لثلاث أو أربع دقائق إضافيَّة.',
      'طريقة التقديم: يُحمَّص الخبز، ويوضع في طبق التقديم، ويوزَّع الفطر والكايل عليه، وعلى الوجه تُضاف البيضة. وينثر الفلفل الأسود.',
    ],
    service: 4,
    timeForCooking: {
      time: 30,
      type: 'دقيقة',
    },
    down: mint2,
    up: mint1,
    color: '#8c5937',
    type: 'نباتي',
  },
  {
    id: '4',
    title: 'خبز النان كيتو',
    additional: '',
    src: b4,
    steps: [
      'تُغسل حبَّات الفطر، وتُقطَّع بحجم متساو.',
      'تُذوب الزبدة في مقلاة، ويُضاف فرم الفطر، مع التقليب لنحو ثلاث دقائق، وذلك على حرارة متوسِّطة.',
      'يُضاف الثوم وأوراق الكايل إلى المقلاة مع الفطر والملح والفلفل، وتُقلَّب المكوِّنات، ويُسكب الماء. تُقلَّب المكوِّنات مجدَّدًا، وتبقى على النار، حتَّى يذبل الكايل.',
      ' في قدر صغيرة حاوية الماء المغلي، تُضاف ركوة تحتوي البيضة، وتُخفَّف الحرارة، وذلك حتَّى تطهى البيضة. يُصبُّ الخل على البيضة بعدها، مع تحريك البيضة بصورة دائريَّة. ثمَّ، تُكسر البيضة من منتصفها، وتُطهى لثلاث أو أربع دقائق إضافيَّة.',
      'طريقة التقديم: يُحمَّص الخبز، ويوضع في طبق التقديم، ويوزَّع الفطر والكايل عليه، وعلى الوجه تُضاف البيضة. وينثر الفلفل الأسود.',
    ],
    service: 4,
    timeForCooking: {
      time: 30,
      type: 'دقيقة',
    },
    down: mint2,
    up: mint1,
    color: '#8c5937',
    type: 'نباتي',
  },
  {
    id: '1',
    title: 'توست بالفطر والبيض للرجيم',
    additional: '',
    src: b1,
    steps: [
      'تُغسل حبَّات الفطر، وتُقطَّع بحجم متساو.',
      'تُذوب الزبدة في مقلاة، ويُضاف فرم الفطر، مع التقليب لنحو ثلاث دقائق، وذلك على حرارة متوسِّطة.',
      'يُضاف الثوم وأوراق الكايل إلى المقلاة مع الفطر والملح والفلفل، وتُقلَّب المكوِّنات، ويُسكب الماء. تُقلَّب المكوِّنات مجدَّدًا، وتبقى على النار، حتَّى يذبل الكايل.',
      ' في قدر صغيرة حاوية الماء المغلي، تُضاف ركوة تحتوي البيضة، وتُخفَّف الحرارة، وذلك حتَّى تطهى البيضة. يُصبُّ الخل على البيضة بعدها، مع تحريك البيضة بصورة دائريَّة. ثمَّ، تُكسر البيضة من منتصفها، وتُطهى لثلاث أو أربع دقائق إضافيَّة.',
      'طريقة التقديم: يُحمَّص الخبز، ويوضع في طبق التقديم، ويوزَّع الفطر والكايل عليه، وعلى الوجه تُضاف البيضة. وينثر الفلفل الأسود.',
    ],
    service: 4,
    timeForCooking: {
      time: 30,
      type: 'دقيقة',
    },
    down: mint2,
    up: mint1,
    color: '#8c5937',
    type: 'نباتي',
  },
  {
    id: '2',
    title: 'شكشوكة البيض والخضار',
    additional: '',
    src: b2,
    steps: [
      'تُغسل حبَّات الفطر، وتُقطَّع بحجم متساو.',
      'تُذوب الزبدة في مقلاة، ويُضاف فرم الفطر، مع التقليب لنحو ثلاث دقائق، وذلك على حرارة متوسِّطة.',
      'يُضاف الثوم وأوراق الكايل إلى المقلاة مع الفطر والملح والفلفل، وتُقلَّب المكوِّنات، ويُسكب الماء. تُقلَّب المكوِّنات مجدَّدًا، وتبقى على النار، حتَّى يذبل الكايل.',
      ' في قدر صغيرة حاوية الماء المغلي، تُضاف ركوة تحتوي البيضة، وتُخفَّف الحرارة، وذلك حتَّى تطهى البيضة. يُصبُّ الخل على البيضة بعدها، مع تحريك البيضة بصورة دائريَّة. ثمَّ، تُكسر البيضة من منتصفها، وتُطهى لثلاث أو أربع دقائق إضافيَّة.',
      'طريقة التقديم: يُحمَّص الخبز، ويوضع في طبق التقديم، ويوزَّع الفطر والكايل عليه، وعلى الوجه تُضاف البيضة. وينثر الفلفل الأسود.',
    ],
    service: 4,
    timeForCooking: {
      time: 30,
      type: 'دقيقة',
    },
    down: mint2,
    up: mint1,
    color: '#8c5937',
    type: 'نباتي',
  },
  {
    id: '3',
    title: 'البيض بالطريقة التركية',
    additional: '',
    src: b3,
    steps: [
      'تُغسل حبَّات الفطر، وتُقطَّع بحجم متساو.',
      'تُذوب الزبدة في مقلاة، ويُضاف فرم الفطر، مع التقليب لنحو ثلاث دقائق، وذلك على حرارة متوسِّطة.',
      'يُضاف الثوم وأوراق الكايل إلى المقلاة مع الفطر والملح والفلفل، وتُقلَّب المكوِّنات، ويُسكب الماء. تُقلَّب المكوِّنات مجدَّدًا، وتبقى على النار، حتَّى يذبل الكايل.',
      ' في قدر صغيرة حاوية الماء المغلي، تُضاف ركوة تحتوي البيضة، وتُخفَّف الحرارة، وذلك حتَّى تطهى البيضة. يُصبُّ الخل على البيضة بعدها، مع تحريك البيضة بصورة دائريَّة. ثمَّ، تُكسر البيضة من منتصفها، وتُطهى لثلاث أو أربع دقائق إضافيَّة.',
      'طريقة التقديم: يُحمَّص الخبز، ويوضع في طبق التقديم، ويوزَّع الفطر والكايل عليه، وعلى الوجه تُضاف البيضة. وينثر الفلفل الأسود.',
    ],
    service: 4,
    timeForCooking: {
      time: 30,
      type: 'دقيقة',
    },
    down: mint2,
    up: mint1,
    color: '#8c5937',
    type: 'نباتي',
  },
  {
    id: '4',
    title: 'خبز النان كيتو',
    additional: '',
    src: b4,
    steps: [
      'تُغسل حبَّات الفطر، وتُقطَّع بحجم متساو.',
      'تُذوب الزبدة في مقلاة، ويُضاف فرم الفطر، مع التقليب لنحو ثلاث دقائق، وذلك على حرارة متوسِّطة.',
      'يُضاف الثوم وأوراق الكايل إلى المقلاة مع الفطر والملح والفلفل، وتُقلَّب المكوِّنات، ويُسكب الماء. تُقلَّب المكوِّنات مجدَّدًا، وتبقى على النار، حتَّى يذبل الكايل.',
      ' في قدر صغيرة حاوية الماء المغلي، تُضاف ركوة تحتوي البيضة، وتُخفَّف الحرارة، وذلك حتَّى تطهى البيضة. يُصبُّ الخل على البيضة بعدها، مع تحريك البيضة بصورة دائريَّة. ثمَّ، تُكسر البيضة من منتصفها، وتُطهى لثلاث أو أربع دقائق إضافيَّة.',
      'طريقة التقديم: يُحمَّص الخبز، ويوضع في طبق التقديم، ويوزَّع الفطر والكايل عليه، وعلى الوجه تُضاف البيضة. وينثر الفلفل الأسود.',
    ],
    service: 4,
    timeForCooking: {
      time: 30,
      type: 'دقيقة',
    },
    down: mint2,
    up: mint1,
    color: '#8c5937',
    type: 'نباتي',
  },
  {
    id: '4',
    title: 'خبز النان كيتو',
    additional: '',
    src: b5,
    steps: [
      'تُغسل حبَّات الفطر، وتُقطَّع بحجم متساو.',
      'تُذوب الزبدة في مقلاة، ويُضاف فرم الفطر، مع التقليب لنحو ثلاث دقائق، وذلك على حرارة متوسِّطة.',
      'يُضاف الثوم وأوراق الكايل إلى المقلاة مع الفطر والملح والفلفل، وتُقلَّب المكوِّنات، ويُسكب الماء. تُقلَّب المكوِّنات مجدَّدًا، وتبقى على النار، حتَّى يذبل الكايل.',
      ' في قدر صغيرة حاوية الماء المغلي، تُضاف ركوة تحتوي البيضة، وتُخفَّف الحرارة، وذلك حتَّى تطهى البيضة. يُصبُّ الخل على البيضة بعدها، مع تحريك البيضة بصورة دائريَّة. ثمَّ، تُكسر البيضة من منتصفها، وتُطهى لثلاث أو أربع دقائق إضافيَّة.',
      'طريقة التقديم: يُحمَّص الخبز، ويوضع في طبق التقديم، ويوزَّع الفطر والكايل عليه، وعلى الوجه تُضاف البيضة. وينثر الفلفل الأسود.',
    ],
    service: 4,
    timeForCooking: {
      time: 30,
      type: 'دقيقة',
    },
    down: mint2,
    up: mint1,
    color: '#8c5937',
    type: 'نباتي',
  },
  {
    id: '4',
    title: 'خبز النان كيتو',
    additional: '',
    src: b6,
    steps: [
      'تُغسل حبَّات الفطر، وتُقطَّع بحجم متساو.',
      'تُذوب الزبدة في مقلاة، ويُضاف فرم الفطر، مع التقليب لنحو ثلاث دقائق، وذلك على حرارة متوسِّطة.',
      'يُضاف الثوم وأوراق الكايل إلى المقلاة مع الفطر والملح والفلفل، وتُقلَّب المكوِّنات، ويُسكب الماء. تُقلَّب المكوِّنات مجدَّدًا، وتبقى على النار، حتَّى يذبل الكايل.',
      ' في قدر صغيرة حاوية الماء المغلي، تُضاف ركوة تحتوي البيضة، وتُخفَّف الحرارة، وذلك حتَّى تطهى البيضة. يُصبُّ الخل على البيضة بعدها، مع تحريك البيضة بصورة دائريَّة. ثمَّ، تُكسر البيضة من منتصفها، وتُطهى لثلاث أو أربع دقائق إضافيَّة.',
      'طريقة التقديم: يُحمَّص الخبز، ويوضع في طبق التقديم، ويوزَّع الفطر والكايل عليه، وعلى الوجه تُضاف البيضة. وينثر الفلفل الأسود.',
    ],
    service: 4,
    timeForCooking: {
      time: 30,
      type: 'دقيقة',
    },
    down: mint2,
    up: mint1,
    color: '#8c5937',
    type: 'نباتي',
  },
];
export default itemsArray;
